Revit 2024 API
ViewSchedule.GetSegmentCount Method
 Gets the total count of schedule segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public int GetSegmentCount()
Visual Basic
Public Function GetSegmentCount As Integer
Visual C++
public:
int GetSegmentCount()
Return Value
 The total count of schedule segments. 1 means the schedule is not split yet.
Remarks
 There will be at least one segment for a schedule.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace